InformationRegisters/УДАЛИТЬ_кпкСведенияАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>УДАЛИТЬ_кпкСведенияАгента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ассортимент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Удалить_кпкАссортименты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписокСкладов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Удалить_кпкСпискиСкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АПСПапка</Name>
					<Comment>Папка агента на Агент+ сервере</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПарольЗИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяФирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Удалить_кпкКПК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПередвижнойСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрефиксНомеровДок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КартаАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Удалить_кпкКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветМаршрута</Name>
					<Comment>Цвет маршрута</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОплатыПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписокКонтрагентов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КассыАгента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступностьТиповЦен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кпкДоступностьТиповЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступныеТипыЦен</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныеНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапретитьВыборТипаЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойТипЦены</Name>
					<Comment>Основной тип цены используемый агентов при создании документов в МУ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Агенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УДАЛИТЬ_кпкСведенияАгента/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	
	РежимВыгрузкиКонтрагентов = Константы.кпкРежимВыгрузкиКонтрагентов.Получить();
	Элементы.Страницы.ПодчиненныеЭлементы.СписокДоговоров.Видимость = Ложь;
	Элементы.Страницы.ПодчиненныеЭлементы.СписокКонтрагентов.Видимость = Ложь;
	
	УстановитьЗначениеИдентификатора();
	
	Если РежимВыгрузкиКонтрагентов = 1 или РежимВыгрузкиКонтрагентов = 4 Тогда // Выгрузка клиентов по договорам
		
		Элементы.Страницы.ПодчиненныеЭлементы.СписокДоговоров.Видимость = Истина;
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	кпкДоговораАгентов.Договор.Владелец КАК Контрагент,
		|	кпкДоговораАгентов.Договор
		|ИЗ
		|	Справочник.кпкДоговораАгентов КАК кпкДоговораАгентов
		|ГДЕ
		|	кпкДоговораАгентов.Владелец = &Агент
		|УПОРЯДОЧИТЬ ПО
		|	кпкДоговораАгентов.Договор.Владелец.Наименование
		|ИТОГИ ПО
		|	Контрагент";
		
		//ЗагрузитьДеревоДоговоров(ТекстЗапроса);
		
	ИначеЕсли РежимВыгрузкиКонтрагентов = 2 Тогда // По списку контрагентов
		
		Элементы.Страницы.ПодчиненныеЭлементы.СписокКонтрагентов.Видимость = Истина;
		
		ТабКонтрагентов = РегистрыСведений.кпкСведенияАгента.Получить(Новый Структура("Объект", Запись.Объект)).СписокКонтрагентов.Получить();
		
		Если Не ТабКонтрагентов = Неопределено Тогда
			Для Каждого ТекСтрока Из ТабКонтрагентов Цикл
				НоваяСтрока 		   = ТаблицаКонтрагентов.Добавить();
				НоваяСтрока.Контрагент = ТекСтрока.Контрагент;			
			КонецЦикла;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНастройки(Команда)
	
	Если НЕ ЗначениеЗаполнено(Запись.Объект) Тогда
    	Предупреждение("Не выбран агент",10);
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
    	Предупреждение("Сведения агента не записаны.",10);
		Возврат;
	КонецЕсли;
	
	СтруктураДополнительныеНастройки = Новый Структура;
	СтруктураДополнительныеНастройки.Вставить("Агент",Запись.Объект);
	
	ФормаДопНастроек  = ПолучитьФорму("Обработка.кпкНастройкаАгентПлюс.Форма", СтруктураДополнительныеНастройки);

	ФормаДопНастроек.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Хранилище = Новый ХранилищеЗначения(ТаблицаКонтрагентов.Выгрузить());
	ТекущийОбъект.СписокКонтрагентов = Хранилище;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеИдентификатора()
	
	Если ЗначениеЗаполнено(Запись.КПК.Идентификатор) Тогда
		ЗначениеИдентификатора = Запись.КПК.Идентификатор;
	Иначе
		ЗначениеИдентификатора = "<Идентификатор не указан>";		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КПКПриИзменении(Элемент)
	
	УстановитьЗначениеИдентификатора();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКонтрагентов(Команда)
	
	ВладелецФормы = Элементы.ТаблицаКонтрагентов;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФормуМодально("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, ВладелецФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКонтрагентов(Команда)
	
	Если ТаблицаКонтрагентов.Количество() > 0 Тогда
		Ответ = Вопрос("Таблица контрагентов будет полностью очищена. Вы хотите продолжить?", РежимДиалогаВопрос.ДаНет, 10);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ТаблицаКонтрагентов.Очистить();	
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКонтрагентовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Если ТаблицаКонтрагентов.НайтиСтроки(Новый Структура("Контрагент", ВыбранноеЗначение)).Количество() = 0 Тогда
			СтрокаТаблицаКонтрагентов = ТаблицаКонтрагентов.Добавить();
			СтрокаТаблицаКонтрагентов.Контрагент = ВыбранноеЗначение;	
			Модифицированность = Истина;
		Иначе
			Предупреждение(НСтр("ru = 'Контрагент уже присутствует в списке'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКонтрагентовПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КПКОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
КонецПроцедуры
